Repository: Sjoerd1993/Graphs
Catalog: po/*.po
Languages: fr

source: Graphs
fr: Graphes

source: Plot and manipulate data
fr: Tracer et manipuler des données

source: Graphs is a simple, yet powerful tool that allows you to plot and manipulate your data with ease. New data can be imported from a wide variety of filetypes, or generated by equation. All data can be manipulated using a variety of operations such as the ability to select, cut, translate, multiply, center and smoothen data, as well as apply any custom transformations on the data.
fr: Graphes est un outil simple mais puissant qui vous permet de tracer et manipuler vos données facilement. De nouvelles données peuvent être générées par équation ou importées depuis une grande variété de type de fichiers. Toutes les données peuvent être manipulées et subir diverses opérations, comme être sélectionnées, coupées, translatées, multipliées, lissées ou transformées de manière personnalisée.

source: Moreover, Graphs supports curve fitting on imported data and offers extensive customization options for the style of the plots. You can fine-tune and personalize stylesheets to your liking.
fr: De plus, Graphes prend en charge l’extrapolation de courbe sur les données importées et offre des options de personnalisation étendue pour le style des courbes. Vous pouvez affiner et personnaliser les feuilles de style selon vos envies.

source: Graphs is an excellent fit for both plotting and data manipulation. The plots created with Graphs can be saved in a variety of formats suitable for sharing and presenting to a wide audience, such as in a scientific publication or presentations. Additionally, the option to save plots as vector images allows for easy editing in software like Inkscape for further refinement. Graphs is written with the GNOME environment in mind, but should be suitable for any other desktop environment as well.
fr: Graphes est un excellent choix pour tracer des courbes et manipuler de données. Les graphiques créés avec Graphes peuvent être enregistrés dans divers formats adaptés au partage et à la présentation à un large public, comme pour une présentation ou une publication scientifique. De plus, il est possible d’enregistrer les graphiques en tant qu’images vectorielles, ce qui vous permet de les éditer facilement dans un logiciel comme Inkscape afin de peaufiner leur rendu. Graphes a été écrit pour s’intégrer au mieux dans l’environnement GNOME, mais devrait également convenir à tout autre environnement de bureau.

source: For any feedback, questions or general issues, please file an issue on the GitLab page.
fr: Que ce soit pour un commentaire, des questions ou un problème en général, veuillez créer un ticket sur la page GitLab.

source: 1 - Plot and manipulate any data of choice
fr: 1 - Tracer et manipuler n’importe quelles données

source: 2 - Full support for light and dark mode
fr: 2 - Prise en charge complète du mode clair et foncé

source: 3 - Generate data from an equation
fr: 3 - Générer des données depuis une équation

source: 4 - Edit plot stylesheets
fr: 4 - Modifier le style des graphiques

source: 5 - Manipulate imported data with ease
fr: 5 - Manipuler les données importées avec facilité

source: Plotting;Graph;Graphing;Science;Mathematics;Math;Equations;Data;Plot;Visualisation;Visualization;Fitting;xrdml;
fr: Traçage;Graphe;Graphique;Science;Mathématiques;Math;Équations;Données;Tracer;Visualisation;Extrapolation;xrdml;

source: Add Equation
fr: Ajouter une équation

source: Cancel
fr: Annuler

source: Add
fr: Ajouter

source: Enter a mathematical expression to generate data from
fr: Entrer une expression mathématique à partir de laquelle générer des données

source: Name (optional)
fr: Nom (optionnel)

source: X Start
fr: X début

source: X Stop
fr: X fin

source: Step Size
fr: Taille du pas

source: Add New Style
fr: Ajouter un nouveau style

source: Template
fr: Modèle

source: Name
fr: Nom

source: Curve Fitting
fr: Extrapolation de courbe

source: Open Curve Fitting Menu
fr: Ouvrir le menu d’extrapolation de courbe

source: Equation
fr: Équation

# regression-type
source: Linear
fr: Linéaire

# regression-type
source: Quadratic
fr: Quadratique

# regression-type
source: Exponential
fr: Exponentielle

# regression-type
source: Power Law
fr: Loi de puissance

# regression-type
source: Logarithmic
fr: Logarithmique

# regression-type
source: Sigmoid Logistic
fr: Sigmoïde

# regression-type
source: Gaussian
fr: Gaussienne

# regression-type
source: Custom
fr: Personnalisée

source: Add Fit to Data
fr: Ajouter une extrapolation aux données

source: Toggle Sidebar
fr: Basculer le panneau latéral

source: Canvas Failed to Load
fr: Échec de chargement du canevas

source: Optimization Method
fr: Méthode d’optimisation

# optimization
source: Trust Region Reflective
fr: Région de confiance

source: Confidence Bounds
fr: Limites de confiance

# confidence
source: None
fr: Aucune

# confidence
source: 1σ: 68% Confidence
fr: 1σ : confiance de 68%

# confidence
source: 2σ: 95% Confidence
fr: 2σ : confiance de 95%

# confidence
source: 3σ: 99.7% Confidence
fr: 3σ : confiance de 99,7%

source: Save Changes?
fr: Enregistrer les modifications ?

source: Current project contains unsaved changes, changes that are not saved will be permanently lost.
fr: Le projet actuel contient des modifications non enregistrées. Les modifications non enregistrées seront définitivement perdues.

source: Discard
fr: Abandonner

source: Save
fr: Enregistrer

source: Delete Style?
fr: Supprimer le style ?

source: Delete
fr: Supprimer

source: Reset to Defaults?
fr: Réinitialiser aux valeurs par défaut ?

source: Reset
fr: Réinitialiser

source: Selected Item
fr: Élément sélectionné

source: Choose which item to edit
fr: Choisir quel élément modifier

source: Data
fr: Données

source: X-Axis Position
fr: Position de l’axe X

source: Bottom
fr: Bas

source: Top
fr: Haut

source: Y-Axis Position
fr: Position de l’axe Y

source: Left
fr: Gauche

source: Right
fr: Droite

source: Line Properties
fr: Propriétés de ligne

source: Linestyle
fr: Style de ligne

# linestyle
source: None
fr: Aucun

# linestyle
source: Solid
fr: Plein

# linestyle
source: Dotted
fr: Pointillé

# linestyle
source: Dashed
fr: Trait

# linestyle
source: Dashdot
fr: Trait-point

source: Linewidth
fr: Largeur de ligne

source: Markers
fr: Marqueurs

# markerstyle
source: None
fr: Aucun

# markerstyle
source: Circle
fr: Cercle

# markerstyle
source: Triangle Down
fr: Triangle vers le bas

# markerstyle
source: Triangle Up
fr: Triangle vers le haut

# markerstyle
source: Triangle Left
fr: Triangle vers la gauche

# markerstyle
source: Triangle Right
fr: Triangle vers la droite

# markerstyle
source: Octagon
fr: Octogone

# markerstyle
source: Square
fr: Carré

# markerstyle
source: Pentagon
fr: Pentagone

# markerstyle
source: Star
fr: Étoile

# markerstyle
source: Hexagon 1
fr: Hexagone 1

# markerstyle
source: Hexagon 2
fr: Hexagone 2

# markerstyle
source: X
fr: Croix

# markerstyle
source: Diamond
fr: Diamant

# markerstyle
source: Thin Diamond
fr: Diamant fin

# markerstyle
source: Vertical Line
fr: Ligne verticale

# markerstyle
source: Horizontal Line
fr: Ligne horizontale

# markerstyle
source: Filled Plus
fr: Plus plein

# markerstyle
source: Filled X
fr: Croix pleine

source: Marker Size
fr: Taille du marqueur

source: Export Figure
fr: Exporter le graphique

source: Export
fr: Exporter

source: File Format
fr: Format du fichier

source: Resolution (dpi)
fr: Résolution (dpi)

source: Transparent Background
fr: Arrière-plan transparent

source: Figure Settings
fr: Paramètres du graphique

source: Labels
fr: Étiquettes

source: Title
fr: Titre

source: Bottom X Axis Label
fr: Étiquette de l’axe X du bas

source: Top X Axis Label
fr: Étiquette de l’axe X du haut

source: Left Y Axis Label
fr: Étiquette de l’axe Y de gauche

source: Right Y Axis Label
fr: Étiquette de l’axe Y de droite

source: Axis Limits
fr: Limites des axes

source: Bottom X Axis Minimum
fr: Minimum de l’axe X du bas

source: Bottom X Axis Maximum
fr: Maximum de l’axe X du bas

source: Top X Axis Minimum
fr: Minimum de l’axe X du haut

source: Top X Axis Maximum
fr: Maximum de l’axe X du haut

source: Left Y Axis Minimum
fr: Minimum de l’axe Y de gauche

source: Left Y Axis Maximum
fr: Maximum de l’axe Y de gauche

source: Right Y Axis Minimum
fr: Minimum de l’axe Y de droite

source: Right Y Axis Maximum
fr: Maximum de l’axe Y de droite

source: Scaling
fr: Échelle

source: Bottom X Axis Scale
fr: Échelle de l’axe X du bas

# scale
source: Linear
fr: Linéaire

# scale
source: Logarithmic
fr: Logarithmique

# scale
source: Square Root
fr: Racine carrée

source: Top X Axis Scale
fr: Échelle de l’axe X du haut

source: Left Y Axis Scale
fr: Échelle de l’axe Y de gauche

source: Right Y Axis Scale
fr: Échelle de l’axe Y de droite

source: Appearance
fr: Apparence

source: Legend
fr: Légende

source: Legend Position
fr: Position de la légende

# legend-position
source: Auto
fr: Automatique

# legend-position
source: Upper Right
fr: En haut à droite

# legend-position
source: Upper Left
fr: En haut à gauche

# legend-position
source: Lower Left
fr: En bas à gauche

# legend-position
source: Lower Right
fr: En bas à droite

# legend-position
source: Center Left
fr: Centrée à gauche

# legend-position
source: Center Right
fr: Centrée à droite

# legend-position
source: Lower Center
fr: Centrée en bas

# legend-position
source: Upper Center
fr: Centrée en haut

# legend-position
source: Center
fr: Centrée

source: Hide Unselected Items
fr: Masquer les éléments non sélectionnés

source: Set as Default
fr: Définir comme paramètres par défaut

source: Initial Guess
fr: Approximation initiale

source: Modify Import Parameters
fr: Modifier les paramètres d’import

source: Import
fr: Importer

source: Pick Color
fr: Choisir une couleur

source: Move Item
fr: Déplacer l’élément

source: Edit Item
fr: Modifier l’élément

source: Remove Item
fr: Supprimer l’élément

# shortcut window
source: General
fr: Général

# shortcut window
source: Show Shortcuts
fr: Afficher les raccourcis

# shortcut window
source: Open Help
fr: Ouvrir l’aide

# shortcut window
source: Open Figure Settings
fr: Ouvrir les paramètres du graphique

# shortcut window
source: Close Application
fr: Fermer l’application

# shortcut window
source: Close Application Window
fr: Fermer la fenêtre d’application

# shortcut window
source: Mode Switching
fr: Changement de mode

# shortcut window
source: Pan Mode
fr: Mode navigation

# shortcut window
source: Zoom Mode
fr: Mode zoom

# shortcut window
source: Select Mode
fr: Mode sélection

# shortcut window
source: New Data
fr: Nouvelles données

# shortcut window
source: Add Data from Equation
fr: Ajouter des données à partir d’une équation

# shortcut window
source: Add Data from File
fr: Ajouter des données à partir d’un fichier

# shortcut window
source: New Project
fr: Nouveau projet

# shortcut window
source: Open Project
fr: Ouvrir un projet

# shortcut window
source: Delete Selected Data
fr: Supprimer les données sélectionnées

# shortcut window
source: Save and Export
fr: Enregistrer et exporter

# shortcut window
source: Export Data
fr: Exporter les données

# shortcut window
source: Export Figure
fr: Exporter le graphique

# shortcut window
source: Save Project
fr: Enregistrer le projet

# shortcut window
source: Save Project As
fr: Enregistrer le projet sous

# shortcut window
source: View
fr: Vue

# shortcut window
source: Previous View
fr: Vue précédente

# shortcut window
source: Next View
fr: Vue suivante

# shortcut window
source: Optimize limits
fr: Optimiser les limites

# shortcut window
source: Zoom in
fr: Zoom avant

# shortcut window
source: Zoom out
fr: Zoom arrière

# shortcut window
source: Select None
fr: Sélectionner aucun

# shortcut window
source: Toggle Sidebar
fr: Basculer le panneau latéral

# shortcut window
source: Select All
fr: Tout sélectionner

# shortcut window
source: Undo Action
fr: Annuler l’action

# shortcut window
source: Redo Action
fr: Rétablir l’action

source: Smoothen Settings
fr: Paramètres de lissage

source: Savitzky–Golay Filter
fr: Filtre Savitzky–Golay

source: Span percentage
fr: Pourcentage de la plage

source: What percentage of the data span to use for the filter window
fr: Pourcentage de la plage de données à utiliser pour la fenêtre de filtrage

source: Polynomial degree
fr: Degré polynomial

source: Moving Average
fr: Moyenne glissante

source: Box points
fr: Nombre de points

source: Amount of points to use when calculating a moving average
fr: Nombre de points à utiliser pour calculer une moyenne glissante

source: Edit
fr: Modifier

source: Remove
fr: Supprimer

source: Error - No Style selected
fr: Erreur - Aucun style détecté

source: Style Name
fr: Nom du style

source: Font
fr: Police

source: Title Size
fr: Taille du titre

source: Title size in relation to text size
fr: Taille du titre par rapport à la taille du texte

source: Label Size
fr: Taille de l’étiquette

source: Label size in relation to text size
fr: Taille de l’étiquette par rapport à la taille du texte

source: Lines
fr: Lignes

source: Axis Width
fr: Largeur des axes

source: Draw Frame
fr: Fenêtre de dessin

source: Ticks
fr: Graduations

source: Tick Directions
fr: Directions de graduation

source: Inwards
fr: Vers l’intérieur

source: Outwards
fr: Vers l’extérieur

source: Minor Ticks
fr: Graduation secondaire

source: Major Tick Width
fr: Largeur de graduation principale

source: Minor Tick Width
fr: Largeur de graduation secondaire

source: Major Tick Length
fr: Longueur de graduation principale

source: Minor Tick Length
fr: Longueur de graduation secondaire

source: Ticks on Bottom Axis
fr: Graduations sur l’axe du bas

source: Ticks on Left Axis
fr: Graduations sur l’axe de gauche

source: Ticks on Right Axis
fr: Graduations sur l’axe de droite

source: Ticks on Top Axis
fr: Graduations sur l’axe du haut

source: Grid
fr: Grille

source: Show Grid
fr: Afficher la grille

source: Grid Width
fr: Largeur de la grille

source: Grid Opacity
fr: Opacité de la grille

source: Padding
fr: Espacement

source: Padding for different parts of the figure
fr: Espacement pour différentes parties du graphique

source: Value Padding
fr: Espacement de valeur

source: Padding between axes and values
fr: Espacement entre les axes et les valeurs

source: Label Padding
fr: Espacement de l’étiquette

source: Padding between axes and labels
fr: Espacement entre les axes et les étiquettes

source: Title Padding
fr: Espacement du titre

source: Padding between axes and the title
fr: Espacement entre les axes et le titre

source: Colors
fr: Couleurs

source: Label text might be hard to read
fr: Texte d’étiquette potentiellement difficile à lire

source: Poor Contrast
fr: Mauvais contraste

source: Text Color
fr: Couleur du texte

source: Change Color
fr: Changer la couleur

source: Tick Color
fr: Couleur de graduation

source: Axis Color
fr: Couleur d’axe

source: Grid Color
fr: Couleur de grille

source: Background Color
fr: Couleur d’arrière-plan

source: Outline Color
fr: Couleur de contour

source: Line Colors
fr: Couleurs de ligne

source: Add Color
fr: Ajouter une couleur

source: Transform Data
fr: Transformer les données

source: Transform
fr: Transformer

source: Additional variables: x_min, y_min x_max, y_max Trigonometric functions use radians by default, append d to the function to use degrees, e.g. sind(x) or cosd(x).
fr: Variables supplémentaires : x_min, y_min x_max, y_max Les fonctions trigonométriques utilisent les radians par défaut, ajouter d à la fonction pour utiliser les degrés, par exemple sind(x) ou cosd(x).

source: More info
fr: Plus d’informations

source: Discard Unselected Data
fr: Abandonner les données non sélectionnées

source: Add New Data
fr: Ajouter de nouvelles données

source: Open Application Menu
fr: Ouvrir le menu d’application

source: No Data
fr: Aucune donnée

source: Add data from a file or manually as an equation
fr: Ajouter les données à partir d’un fichier ou manuellement à l’aide d’une équation

source: Pan Mode. Click and drag to pan
fr: Mode navigation. Cliquer et glisser pour naviguer

source: Zoom Mode. Select an area on the figure to zoom in
fr: Mode zoom. Sélectionner une zone sur le graphique pour effectuer un zoom avant

source: Select Mode. Click and drag to make a selection of data
fr: Mode sélection. Cliquer et glisser pour créer une sélection de données

source: Adjust
fr: Ajuster

source: Shift
fr: Déplacer

source: Shift all data vertically with respect to each other
fr: Déplacer verticalement toutes les données les unes par rapport aux autres

source: Normalize
fr: Normaliser

source: Normalize data
fr: Normaliser les données

source: Smoothen
fr: Lisser

source: Smoothen data
fr: Lisser les données

source: Center
fr: Centrer

source: Center data
fr: Centrer les données

source: Combine
fr: Combiner

source: Combine all selected data
fr: Combiner toutes les données sélectionnées

source: Cut
fr: Couper

source: Cut selected data
fr: Couper les données sélectionnées

source: Derivative
fr: Dériver

source: Get the derivative of the data
fr: Récupérer la dérivée des données

source: Integral
fr: Intégrer

source: Get the indefinite integral of the data
fr: Récupérer la primitive des données

source: Get the Fast Fourier Transform of the data
fr: Récupérer la transformation de Fourier rapide des données

source: Inverse FFT
fr: FFT inverse

source: Get the Inverse Fast Fourier Transform of the data
fr: Récupérer la transformation de Fourier rapide inverse des données

source: Custom Transformation
fr: Transformation personnalisée

source: Perform custom transformations on the data
fr: Effectuer des transformations personnalisées sur les données

source: Modify
fr: Modifier

source: Translate X
fr: Translater X

source: Translate Y
fr: Translater Y

source: Multiply X
fr: Multiplier X

source: Multiply Y
fr: Multiplier Y

source: Undo
fr: Annuler

source: Redo
fr: Rétablir

source: View Menu
fr: Menu d’affichage

source: Next View
fr: Vue suivante

source: Previous View
fr: Vue précédent

source: New Project
fr: Nouveau projet

source: Save Project…
fr: Enregistrer le projet…

source: Save Project as…
fr: Enregistrer le projet sous…

source: Open Project…
fr: Ouvrir un projet…

source: Export Data…
fr: Exporter les données…

source: Export Figure…
fr: Exporter le graphique…

source: Keyboard Shortcuts
fr: Raccourcis clavier

source: Help
fr: Aide

source: About Graphs
fr: À propos de Graphes

source: Add Data from File…
fr: Ajouter des données à partir d’un fichier…

source: Add Equation…
fr: Ajouter une équation…

source: At Maximum Y Value
fr: À la valeur Y maximale

source: At Middle X Value
fr: À la valeur X moyenne

source: Advanced Settings
fr: Paramètres avancés

source: translator-credits
fr: Vincent Chatelain <vinchatl_gnome@proton.me>

source: {error} - Unable to add data from equation
fr: {error} - Impossible d’ajouter des données à partir de l’équation

source: Exported Figure
fr: Graphique exporté

source: Deleted {name}
fr: {name} supprimé

source: Could not load {font}
fr: Impossible de charger {font}

source: Results:
fr: Résultats :

source: Please enter valid fitting parameters to start the fit
fr: Veuillez entrer des paramètres d’extrapolation valides pour commencer l’extrapolation

source: Please enter a valid equation to start the fit
fr: Veuillez entrer une équation valide pour commencer l’extrapolation

source: Please enter valid fitting bounds to start the fit
fr: Veuillez entrer des limites d’extrapolation valides pour commencer l’extrapolation

source: Sum of R²: {R2}
fr: Somme de R² : {R2}

source: Fitting Parameters for %s
fr: Paramètre d’extrapolation pour %s

source: Untitled Project
fr: Projet sans nom

source: Draft
fr: Brouillon

# filename
source: Exported Figure
fr: Graphique exporté

source: Defaults Updated
fr: Paramètres par défaut mis à jour

source: X Axis Minimum
fr: Minimum de l’axe X

source: Y Axis Minimum
fr: Minimum de l’axe Y

source: X Axis Maximum
fr: Maximum de l’axe X

source: Y Axis Maximum
fr: Maximum de l’axe Y

source: X Axis Scale
fr: Échelle de l’axe X

source: X Axis Label
fr: Étiquette de l’axe X

source: Y Axis Scale
fr: Échelle de l’axe Y

source: Are you sure you want to reset the import settings?
fr: Voulez-vous vraiment réinitialiser les paramètres d’import ?

# file-filter
source: Graphs Project File
fr: Fichier de projet Graphes

source: {name}: Unable to do transformation, make sure the syntax is correct
fr: {name} : Impossible d’effectuer la transformation, vérifiez la syntaxe

source: Unable to do transformation
fr: Impossible d’effectuer la transformation

source: Data that was outside of the highlighted area has been discarded
fr: Les données à l’extérieur de la zone en surbrillance ont été supprimées

source: No data found within the highlighted area
fr: Aucune donnée trouvée dans la zone en surbrillance

source: Combined Data
fr: Données combinées

source: Intensity (cps)
fr: Intensité (cps)

source: Invalid .xry format
fr: Format .xry non valide

source: Import failed, column index out of range
fr: Échec de l’import, un indice de colonne est en dehors de la plage

source: Unable to import from file
fr: Impossible d’importer à partir du fichier

source: Saved Project
fr: Projet enregistré

source: Project
fr: Projet

source: Missing colon in file {file}, line {line}
fr: Virgule manquante dans le fichier {file}, à la ligne {line}

source: Non-style related parameter {param} in file {file}
fr: Paramètre {param} non lié au style dans le fichier {file}

source: Ignoring parameter {param} in file {file}
fr: Paramètre {param} ignoré dans le fichier {file}

source: Duplicate key in file {file}, on line {line}
fr: Clé dupliquée dans le fichier {file}, à la ligne {line}

source: Bad value in file {file} on line {line}
fr: Mauvaise valeur dans le fichier {file} à la ligne {line}

source: Could not parse {filename}
fr: Impossible d’analyser {filename}

source: X Label
fr: Étiquette X

source: Y Label
fr: Étiquette Y

source: System
fr: Système

source: Could not parse {stylename}, loading system preferred style
fr: Impossible d’analyser {stylename}, chargement du style par défaut à la place

source: Plot style {stylename} does not exist loading system preferred
fr: Le style de tracé {stylename} n’existe pas, chargement du style par défaut à la place

source: Are you sure you want to delete {stylename}?
fr: Êtes-vous sûr de vouloir supprimer {stylename} ?

source: Color {number}
fr: Couleur {number}

# file-filter
source: Supported files
fr: Fichiers pris en charge

# file-filter
source: ASCII files
fr: Fichiers ASCII

source: No data to export
fr: Aucune donnée à exporter

source: Exported Data
fr: Données exportées

# file-filter
source: Text Files
fr: Fichiers texte

source: Graphs (Development)
fr: Graphes (expérimental)

source: Open Location
fr: Ouvrir l’emplacement

source: Optimize Limits
fr: Optimiser les limites

# scale
source: Inverse Root
fr: Racine inverse
